<?php
// +-----------------------------------------------
// | visoty.com PHP文件
// | ==============================================
// | 版权所有 2017-2018 http://www.visoty.com
// | ----------------------------------------------
// | 未经授权不许任何使用和传播。
// | ==============================================
// +-----------------------------------------------
// |  @date: 2017年11月2日下午4:37:47
// |  @author: vson.mail@gmail.com
// +------------------------------------------------

// 应用公共文件

/**
* 方法用途描述
* 描述：用于处理API访问时返回数组
* @param $array 响应的数据
* @return [] 处理后返回对象
* @date 2017年11月2日下午4:38:58
*/
function resultArray($array)
{
    if(isset($array['data'])) {
        $array['error'] = '';
        $code = 200;
    } elseif (isset($array['error'])) {
        $code = 400;
        $array['data'] = '';
    }
    return [
        'code'  => $code,
        'data'  => $array['data'],
        'error' => $array['error'],
        'time' => $_SERVER['REQUEST_TIME']
    ];
}

