<?php
// +-----------------------------------------------
// | visoty.com PHP文件
// | ==============================================
// | 版权所有 2017-2018 http://www.visoty.com
// | ----------------------------------------------
// | 未经授权不许任何使用和传播。
// | ==============================================
// +-----------------------------------------------
// |  @date: 2017年11月3日上午10:14:27
// |  @author: vson.mail@gmail.com
// +------------------------------------------------

namespace app\common\model;
use app\common\model\Base;

class SystemBase extends Base
{

    /**
     * @var string 设置当前模型的数据库连接(多数据库访问)
     */
    protected $connection = 'system_db_config';
}